//
// 原产喜地项目
//
// @ date 2016-04-28 10:49:08
// @ author simonsun
// @ email simonsun@xidibuy.com
//
//堆栈（英语：stack），也可直接称栈。是一种特殊的串列形式的数据结构，它的特殊之处在于只能允许在链接串列或阵列的一端（称为堆叠顶端指标，英语：top）进行加入资料（英语：push）和输出资料（英语：pop）的运算。另外堆叠也可以用一维阵列或连结串列的形式来完成。堆叠的另外一个相对的操作方式称为伫列。
//
//由于堆叠数据结构只允许在一端进行操作，因而按照后进先出（LIFO, Last In First Out）的原理运作。
//
//堆叠数据结构使用两种基本操作：推入（push）和弹出（pop）：
//
//    推入：将数据放入堆叠的顶端（阵列形式或串列形式），堆叠顶端top指标加一。
//    弹出：将顶端数据资料输出（回传），堆叠顶端资料减一。
//
//栈的基本特点：
//
//1，先入后出，后入先出。
//2，除头尾节点之外，每个元素有一个前驱，一个后继。

package main

import (
	_ "fmt"
)

//栈很简单，先不做示例
func main() {
	//var data []byte = []byte{2,4,1,2,5,6}
	//var data []byte = []byte{3,1,3,5,6,4}
}
